In [1]:
%matplotlib inline

import os
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt

In [2]:
DATA_FOLDER = 'data/'

In [3]:
sales = pd.read_csv(DATA_FOLDER + 'sales_train.csv.gz')
items = pd.read_csv(DATA_FOLDER + 'items.csv')
shops = pd.read_csv(DATA_FOLDER + 'shops.csv')
categories = pd.read_csv(DATA_FOLDER + 'item_categories.csv')

In [4]:
sales.shape

(2935849, 6)

In [5]:
sales.dtypes

date               object
date_block_num      int64
shop_id             int64
item_id             int64
item_price        float64
item_cnt_day      float64
dtype: object

In [6]:
sales.head()

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154      999.00           1.0
1  03.01.2013               0       25     2552      899.00           1.0
2  05.01.2013               0       25     2552      899.00          -1.0
3  06.01.2013               0       25     2554     1709.05           1.0
4  15.01.2013               0       25     2555     1099.00           1.0

In [7]:
# Add fractional part of price as a feature
sales['item_price_fractional'] = sales['item_price'] - sales['item_price'].astype(dtype='int64')
sales.head()

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day,item_price_fractional
0,02.01.2013,0,59,22154,999.00,1.0,0.00
1,03.01.2013,0,25,2552,899.00,1.0,0.00
2,05.01.2013,0,25,2552,899.00,-1.0,0.00
3,06.01.2013,0,25,2554,1709.05,1.0,0.05
4,15.01.2013,0,25,2555,1099.00,1.0,0.00

In [9]:
date_format = pd.to_datetime(sales['date'], format='%d.%m.%Y')

In [10]:
sales['day'] = date_format.dt.day
sales['month'] = date_format.dt.month
sales['year'] = date_format.dt.year

In [12]:
sales.head()

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day,item_price_fractional,day,month,year
0,02.01.2013,0,59,22154,999.00,1.0,0.00,2,1,2013
1,03.01.2013,0,25,2552,899.00,1.0,0.00,3,1,2013
2,05.01.2013,0,25,2552,899.00,-1.0,0.00,5,1,2013
3,06.01.2013,0,25,2554,1709.05,1.0,0.05,6,1,2013
4,15.01.2013,0,25,2555,1099.00,1.0,0.00,15,1,2013